{"created":"2021-01-09T20:51:12.934Z","content":"Twilight Imperium battle report:\n\nI was the Saar, flanked by Naalu and Muaat, with L1z1x and Creuss across the table. \n\nI began my galactic conquest moving my star port and units towards the center of the board claiming planets but leaving them unoccupied. The Saar don't need to hold their home world to win like other races and mecatol rex surrounded by two asteroid fields I had the perfect place to set up a new more permanent home. \nUnfortunately my systems had a wormhole in the center which connected to L1z1x controlled space and the Creuss could portal through easily too. \n\nI quickly identified that the L1Z1X would not form a stable alliance and so initiated trade with Creuss while suggesting Muaat moves their war sun, the games most powerful unit, towards Creuss to ensure they remain at the other end of the galaxy. \n\nThe Naalu sniped Mecatol Rex from Saar hands one turn early. Rather than engaging in combat we requested a simple trade good to ensure a turn of peace. \n\nThe Creuss and L1Z1X had some political discourse. Despite a VERY favourable non-binding deal in L1z1x favour in which they gained speaker, L1z1x betrayed the terms of the deal. Creuss made it their mission to destroy the L1z1x. Seeing opportunity to take these two out of the game through mutual destruction, I started bank rolling Creuss to incite more violence. \n\nWith the galaxy entering a stable state, the remaining non warring factions began obtain victory points. I took Mecatol Rex and solidified my position to prevent an assault of Muaat war suns. \n\nTurns later, if I could retain Mecatol Rex I would win, I claimed the Imperial strategy card. Only Naalu used a secret action to prevent my claim, took the card for themselves and won by claiming a public victory card. What a game. \n\nWe played out the combat between my pitiful army against the war suns for the lols. I could not hold in space but could maintain the ground with a single group troop remaining","createdDate":"2021-01-10","createdTime":"09:51"}