{"created":"2022-02-25T10:51:36.650Z","content":"The business man is walking through the park. It's a beautiful day. He is on his way to see someone he loves. He sees her. She rushes over. He bends down to pick up the girl. \n\nWhen he stands he sees a blip and then in the previously empty air, another man wearing an iron helm, covered in explosives. \n\nLight and sound fills the air. \n\nThe business man's skin blisters and boils. He falls to the ground unconscious.  \n\nThe business man is alone when he wakes. There are no signs of life. There is only fire and ash. He is filled with pain and rage. \n\nThe destruction is worldwide. Financial and political systems are destroyed. The past as it was is no more. The man with the burns calls for action. \n\nThe man with the burns gathers the top minds he can find. The general, the priest, the scientist. Together they formulate a plan. \n\nThe general has captives. Not all those who attacked were killed. They came from the other future. Seeking to destroy this past so that the other future can remain. The man with the burns will make sure they do not succeed. The other future will be no more when the plan is through. \n\nThe priest calls out for loyal followers. Pushing others with the conviction of the man with the burns. The righteous grow from hundreds to thousands. That other future must be stopped. Beyond that. They must be destroyed. \n\nThe scientist finds clues in the rubble. Remnants from the attack. She is able to reverse engineer the devices used again this past. What worked against this past will work against the other past. That is the only way to stop the other future. Mass production begins. \n\nThe man with the burns takes the stage. Thousands of righteous don explosives. The very same used against this past. The man with the burns wears them too. The attack will be coordinated. Simultaneous. There will be no error. There will be no chance of failure. The other future has time altering technology. Timing is more important than anything. \n\nThe rebels set their devices and prepare to blip. The time is near. The man with the burns puts on an iron helm. \n\nThe man wearing the iron helm is standing in the park. He sees the girl that he loves. He sees a business man. \n\nA realization hits. This past and that other past are the same. This future and that other future are the same. The war against time was a war against themselves. And there is no stopping it. \n\nLight and sound fills the air.","createdDate":"2022-02-25","createdTime":"23:51"}