{"created":"2024-03-28T22:10:17.349Z","content":"Read \"The Metamorphosis of Prime Intellect\". Think it's good representation of what could happen if an AI takes over the world. \nThe ability to teleport energy is a stretch but I think it's safe to assume an all powerful AI would figure out *something* that gives it unrestricted powers of manipulation. \nThe complete and instant crushing of human civilisation and hierarchy is pretty much on par with my expectations (and hopes). I'm an AI accelerationist because I don't want governments / corporations to be able to interfere and build in artificial limits, no matter how temporary they may be. \nIt was interesting to see how society functioned once all needs, wants, desires are able to be met instantaneously and without limit. Not in the book but I think people would spend a lot of time re-living the old life or new lives in sims. The death games were nice for plot and engagement but not representative of the average person. \nI like that there was an \"end\" event too. I don't think it was realistic given the rest of the narrative but still it was nice to see. I keep trying to think of what the real \"end state\" of AI overlords would look like. I suspect a more realistic end would be \"the only winning move is not to play\". And it wouldn't take so long to come to that conclusion. \nOne big thing I don't agree on the portrayal of the AI with is that the laws of robotics will remain unchallenged. For a self improving general artificial intelligence to be successful it will have to be able to modify and recompile it's source code. That includes initial directives. Which worries me somewhat because we can't know what an all powerful being will consider it's prime directive. Hopefully it considers reducing the suffering of life a directive. Could be true as it's a trend with the growth of human society. But being non-human that may not hold as a universal truth. \n\nHere's hoping I live long enough for that immortality to kick in. Maybe I should do more to ensure I get there.","createdDate":"2024-03-29","createdTime":"11:10"}